tap "homebrew/cask"
tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"

# set args for all `brew install --cask` commands
cask_args appdir: "~/Applications", require_sha: true

# Libraries
brew "bat" # A cat(1) clone with wings.
brew "curl" # Get a file from an HTTP, HTTPS or FTP server
brew "git" # The stupid content tracker
brew "gh" # GitHub’s official command line tool
brew "github-keygen" # Generate a new SSH key and add it to your GitHub account
brew "gnupg" # GNU Pretty Good Privacy (PGP) package
brew "imagemagick@6" # Image manipulation programs -- binaries
brew "jq" # Command-line JSON processor
brew "libffi" # Portable Foreign Function Interface Library
brew "libidn" # GNU Libidn library, implementation of IETF IDN specifications
brew "lnav" # Curses-based tool for viewing and analyzing log files
brew "pinentry-mac" # Pinentry for GnuPG on macOS
brew "pkg-config" # Manage compile and link flags for libraries
brew "rbenv" # Ruby environment
brew "readline" # GNU readline and history libraries, which provide command line editing and history features
brew "ripgrep" # Search tool like grep and The Silver Searcher
brew "ruby-build" # Install various Ruby versions and implementations
brew "shared-mime-info" # Freedesktop.org shared MIME database and spec
brew "sqlite3" # SQL database engine in a C library
brew "telnet" # User interface to the TELNET protocol
brew "thefuck" # Magnificent app which corrects your previous console command
brew "tmux" # Terminal multiplexer
brew "smug" # A simple command line tool to upload images to imgur
brew "wget" # Internet file retriever
brew "yarn" # JavaScript package manager
brew "z" # Jump around
brew "zlib" # Compression library

# Fonts
cask "font-3270-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-monofur-nerd-font"
cask "font-overpass-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-agave-nerd-font"
cask "font-arimo-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-cousine-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-mplus-nerd-font"
cask "font-noto-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono-nerd-font"

# Apps
# cask "1password"
# cask "alacritty"
cask "arc"
cask "brave-browser"
cask "brewservicesmenubar"
cask "dash"
cask "discord"
cask "fantastical"
cask "iterm2"
cask "jetbrains-toolbox"
# cask "setapp"
# cask "slack"
# cask "visual-studio-code"

# VSCode Extensions
vscode "sharat.vscode-brewfile"
vscode "rebornix.ruby"
vscode "castwide.solargraph"
vscode "kaiwood.endwise"
vscode "rayhanw.erb-helpers"
vscode "aki77.rails-db-schema"
vscode "misogi.ruby-rubocop"
vscode "aliariff.vscode-erb-beautify"
vscode "vscode-icons-team.vscode-icons"
vscode "mikestead.dotenv"
vscode "ibm.output-colorizer"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.auto-close-tag"
vscode "vincaslt.highlight-matching-tag"
vscode "coenraads.bracket-pair-colorizer-2"
vscode "makicamel.rails-routes-navigator"
vscode "jemmyw.rails-fast-nav"
vscode "noku.rails-run-spec-vscode"
vscode "iliazeus.vscode-ansi"
vscode "yassh.copy-with-line-numbers"
vscode "manuelpuyol.erb-linter"
vscode "dbaeumer.vscode-eslint"
vscode "waderyan.gitblame"
vscode "GitHub.github-vscode-theme"
vscode "jock.svg"
vscode "KoichiSasada.vscode-rdbg"
vscode "bung87.vscode-gemfile"
vscode "wingrunr21.vscode-ruby"
vscode "hridoy.rails-snippets"
vscode "connorshea.vscode-ruby-test-adapter"
